In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [29]:
S=pd.Series(['sara','amal','nora'],index=[1,2,3])

## Q2: Change indexes to 11, 12, 13.

In [30]:
S.index=[11,12,13]
S

11    sara
12    amal
13    nora
dtype: object

## Q3: Retrieve First and second elements.

In [31]:
S[1:3]

12    amal
13    nora
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [32]:
S=pd.concat([S, S],ignore_index=True )
S

0    sara
1    amal
2    nora
3    sara
4    amal
5    nora
dtype: object

In [33]:
S.drop_duplicates()

0    sara
1    amal
2    nora
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [34]:
Student=pd.DataFrame(columns=["ID","Name","GPA"]) 
Student

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [35]:
data=pd.read_csv('educ_figdp_1_Data.csv')
data.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [36]:
print(data.loc[0:5, ['TIME']]) #show from 0 to 5 -index labels as references.

print(data['TIME'][0:5]) #show from 0 to 4 -position as references

   TIME
0  2000
1  2001
2  2002
3  2003
4  2004
5  2005
0    2000
1    2001
2    2002
3    2003
4    2004
Name: TIME, dtype: int64